{
  "about__myInterests": "I like programming, soccer and fishing. Also I like photography. I have been working as a programmer since 2002. I work remotely. Below I tried to estimate my web-programming skills.",
  "about__subTitle": "About me...",
  "about__title": "Hello!",
  "about__whereIlive": "My name is Alexey. I live in Sarov in Nizhny Novgorod region, in 450 km from Moscow. My town is known in Russia, because it's Russian Federal Nuclear Center. The town is a restricted area. You can't visit it without special permission. In 1949 the first Soviet atomic bomb was created in my town. Also Sarov is known as a religion center. In Russia many people know about Serafim Sarovskiy and Diveevo. Sarov is a compact pleasant town surrounded by forests. I love Sarov!",
  "autocomplete__noOptionsText": "No Options",
  "backToHomeButton__text": "Back to Home",
  "buttonText__Cancel": "Cancel",
  "defaultErrorMessage": "Something went wrong",
  "errorMessage__pageNotFound": "Page Not Found",
  "errorPage404__hint__wrongUrl": "Probably you specified a wrong URL",
  "example__subTitle": "Click on the pictures to get additional information",
  "examples__title": "My projects",
  "header__menuItem__About": "About",
  "header__menuItem__Contacts": "Contacts",
  "header__menuItem__Examples": "Examples",
  "header__menuItem__Skills": "Skills",
  "header__menuItem__Specialization": "Specialization",
  "header__menuItem__ToBeginning": "Beginning",
  "loadingMessage": "Loading...",
  "noDataMessage": "No Data",
  "specialization__backendCard__text": "Development on Node.js and Express. I use MongoDB and sockets. unittesting using Mocha, Chai. Create Swagger documentation. Use Docker for deployment. Also can develop REST APIs on Python/Django/MySQL.",
  "specialization__frontendCard__text": "Development on React.js/Redux. Responsive UIs via Flexbox and CSS Grid. Manual build configuration. Different types of testing of UI applications.",
  "specialization__miscCard__text": "Also had an experience in modelling physical processes. DevOps. Python. Development of Windows Phone, JavaME applications. Programming Siemens PLC, etc.",
  "specialization__miscCard__title": "Misc",
  "specialization__subTitle": "Details can be found in <a>my curriculum vitae</a>",
  "specialization__title": "Specialization"
}
