{
  "about__myInterests": "I like programming, fishing, running and ski running. I have been working as a programmer since 2002. Since that time I developed different applications. Last several years I was specialized in the frontend development.",
  "about__subTitle": "About me...",
  "about__title": "Hello!",
  "about__whatIhaveLearned__text": "I started my web development with Python and Django in 2011.<br />In 2014 I started to create SPA apps with the help of <strong>AngularJS</strong>. I had used it for about 3 years.<br />In 2017 I switched to <strong>React</strong> for SPA development. I implemented several successful projects with React (see the examples below). I was lucky – each project I started from scratch, I played a very active part in the development and promoted the application to production. I have tried different UI kits, state managers, many libraries and tools. I have set up the linting, type-checking, transpiling and automated testing.<br />In 2023 I started to use <strong>SSR</strong> (Next.js) and got familiar with TurboRepo.",
  "about__whatIhaveLearned__title": "What I have already tried in the frontend development",
  "about__whatIwantToLearn__text": "* <strong>SSR</strong> - I'd like to continue with SSR. Of course, only if it's suitable for the application I will develop.<br />* <strong>Micro-frontends</strong> - it would be interesting to build a big app based on micro-frontends or re-factor existing legacy app by converting its routes into micro-frontends step-by-step, one after another.<br />* <strong>StoryBook</strong> - I'd like to develop own UI Kit-а and document it with the help of StoryBook.<br />* <strong>Monorepo</strong> – it could be very useful in some cases. For example, when you develop both a frontend and a backend it's very convenient to place them in one repository. Or when your team develops micro-frontends which have big shared code.<br />* <strong>Vue 3</strong> – I'd like to try it in a commercial product.<br />* <strong>GraphQL</strong> – I've met only REST interfaces in my commercial projects. It would be great to try something different ))",
  "about__whatIwantToLearn__title": "Future plans",
  "about__whereIlive": "My name is Alexey. I live in Sarov in Nizhny Novgorod region. My town is known as a scientific center and the place where Soviet nuclear weapon was created. Also, Sarov is a religion center (Serafim Sarovskiy, Diveevo). The town is a restricted area. You can't visit it without special permission.",
  "autocomplete__noOptionsText": "No Options",
  "backToHomeButton__text": "Back to Home",
  "buttonText__Cancel": "Cancel",
  "contacts__email__label": "Email",
  "contacts__location__label": "Location",
  "contacts__location__value": "Russia, Nizhny Novgorod region, Sarov",
  "contacts__phone__label": "Phone",
  "contacts__resume__label": "Curriculum vitae",
  "contacts__subTitle": "Just contact me",
  "contacts__title": "Contacts",
  "customer": "customer",
  "defaultErrorMessage": "Something went wrong",
  "errorMessage__pageNotFound": "Page Not Found",
  "errorPage404__hint__wrongUrl": "Probably you specified a wrong URL",
  "examplePopUp__demoLabel": "Demo",
  "example__subTitle": "Click on the pictures to get additional information",
  "examples__acceptant__description": "Mordovia, a pilot project of ESEK system (Unified Social Card) for transport applications",
  "examples__acceptant__name": "Dashboard UI for the transport supplier",
  "examples__alarm__description": "Project \"Acoustic monitoring\".",
  "examples__alarm__name": "Alarm panel",
  "examples__asr__description": "ASR (Automatic Speech Recognition) system developed by «ITC Sistem-Sarov»",
  "examples__asr__name": "Web interface for speech recognition system made for Russian language",
  "examples__bk__description": "A new landing page with unique and remarkable design",
  "examples__bk__name": "Fight Club on Ren TV channel",
  "examples__cloudike__description": "React.js frontend, Material UI. The web interface for configuring Cloudike backend. For more information about Cloudike go to cloudike.com",
  "examples__cloudike__name": "New admin UI for Cloudike",
  "examples__co2__description": "Project \"Monitoring of CO2 in the air in office\". Frontend and backend (angular, node).",
  "examples__co2__name": "CO2",
  "examples__croc__description": "React.js frontend, Redux. Web interface for managing cloud resources - virtual machine creation, disk, network management, access control, and so on",
  "examples__croc__name": "Web interface for CROC Cloud",
  "examples__detector__description": "Project \"Acoustic monitoring\". Admin UI for managing acoustic detector settings similar to UI of any Wi-Fi router. Also took part in the development of the backend.",
  "examples__detector__name": "Detector UI",
  "examples__dora__description": "Mobile application for Windows Phone. Mobile application for JavaME. Measuring radiation by sensor connected to smartphone. For more information please visit: do-ra.ru",
  "examples__dora__name": "DO-RA, mobile dosimeter-radiometer",
  "examples__iz__description": "I support iz.ru and ren.tv sites. Also I developed 2 new frontend apps for SUZ project (Ticket Management System).<br />Using SUZ our customers can inform us about interesting info events and attach photo and video files.<br />SUZ operators examine the received messages. The most interesting messages are collected and processed by filming a report or writing a note or article.<br />The 1st frontend app is a public part. Our customers use it to send messages to us. It's Next.js app. We used Material UI v5 for building UI.<br />The 2nd frontend is an admin interface for processing messages from customers. It's SPA written on React.js and Material UI v5.",
  "examples__iz__name": "IZ, RenTV, SUZ",
  "examples__mentor__description": "React.js frontend, Redux, RxJS. Listening recorded phone calls and examining analytics results, wave-forms, timelines.",
  "examples__mentor__name": "Speech Analytics web service",
  "examples__mordovia__description": "Mordovia, a pilot project of ESEK system (Unified Social Card) for transport applications",
  "examples__mordovia__name": "Dashboard",
  "examples__novakid__description": "React.js frontend, Material UI. Parent web cabinet - subscription management, lesson booking, child progress, teacher feedbacks, and so on.<br /> Support of many foreign languages including right-to-left ones.",
  "examples__novakid__name": "NovaKid - new parent cabinet",
  "examples__safeCity__description": "\"Mobile Monitor\" application for Windows Phone. Measuring different physical parameters by sensors connected to personal smartphone.",
  "examples__safeCity__name": "Safe City",
  "examples__title": "My projects",
  "examples__uptime__name": "Monitoring of devices installed on buses and trolleybuses",
  "examples__uptime__description": "Mordovia, a pilot project of ESEK system (Unified Social Card) for transport applications",
  "examples__virtman__description": "My team is developing administrative UI for the cloud virtualization system.\nOur customers use the UI to create virtual machines, disks and other resources and to manage them.",
  "examples__virtman__name": "Virtualization system for the tax inspection",
  "examples__votum__description": "Distributed electronic voting system using different communication channels (WEB, SMS, e-mail).",
  "examples__votum__name": "Voting system Votum",
  "header__menuItem__About": "About",
  "header__menuItem__Contacts": "Contacts",
  "header__menuItem__Examples": "Examples",
  "header__menuItem__FuturePlans": "Future plans",
  "header__menuItem__Skills": "Skills",
  "header__menuItem__Specialization": "Specialization",
  "header__menuItem__ToBeginning": "Beginning",
  "howIcanHelp__createArch": "Develop the architecture of application (modules, feature-sliced design)",
  "howIcanHelp__createInfra": "Create the development infrastructure (repo, build, type-checking, linting, auto code formatting)",
  "howIcanHelp__headDevelopment": "Head the development",
  "howIcanHelp__introTesting": "Introduce the automated testing (unit, integration, E2E)",
  "howIcanHelp__orgDeploy": "Automate creation of new versions and deployment + analytics, crash reporting",
  "howIcanHelp__orgReview": "Provide good code review, teach younger developers",
  "howIcanHelp__subTitle": "What I can do for you",
  "loadingMessage": "Loading...",
  "noDataMessage": "No Data",
  "picture__IAM": "My name is Alexey",
  "picture__IamProgrammer": "And I am a programmer",
  "skills__subTitle": "Here I tried to estimate my current level of the knowledge",
  "skills__title": "Knowledge of technologies and tools",
  "specialization__backendCard__text": "Development on Node.js and Express. I use MongoDB and sockets. unittesting using Mocha, Chai. Create Swagger documentation. Use Docker for deployment. Also can develop REST APIs on Python/Django/MySQL.",
  "specialization__frontendCard__text": "Development on React.js. Injection of React components into non-react sites. Own UI library development. Responsive UIs via Flexbox and CSS Grid. Manual build configuration. Different types of testing of UI applications.",
  "specialization__miscCard__text": "Also had an experience in modelling physical processes. DevOps. Python. Development of Windows Phone, JavaME applications. Programming Siemens PLC, etc.",
  "specialization__miscCard__title": "Misc",
  "specialization__subTitle": "Details can be found in <a>my curriculum vitae</a>",
  "specialization__title": "Specialization",
  "year": "year"
}
