{
  "about__myInterests": "Я увлекаюсь программированием, футболом и рыбалкой. Люблю фотографировать. Работаю удалённо. Профессионально программирую с 2002 года. Ниже я попытался примерно оценить своё мастерство в разных технологиях веб-программирования.",
  "about__subTitle": "немного о себе...",
  "about__title": "Привет!",
  "about__whereIlive": "Меня зовут Алексей. Я живу в городе Сарове Нижегородской области в 450 км от Москвы. Мой город известен тем, что на его территории располагается Федеральный Ядерный Центр. Город закрытый. Попасть в него можно только по специальному пропуску. В моём городе в 1949 году была создана первая советская атомная бомба. Также Саров известен как центр православия. Наверное каждый, хотя бы раз в жизни, слышал про Серафима Саровского и про Дивеево... Саров - маленький уютный город, окруженный лесами. Я очень люблю свой город!",
  "autocomplete__noOptionsText": "Нет опций",
  "backToHomeButton__text": "Вернуться на главную",
  "buttonText__Cancel": "Отмена",
  "defaultErrorMessage": "Что-то пошло не так",
  "errorMessage__pageNotFound": "Страница не найдена",
  "errorPage404__hint__wrongUrl": "Возможно, вы указали неверный URL",
  "example__subTitle": "Кликните на картинке для получения деталей",
  "examples__title": "Примеры работ",
  "header__menuItem__About": "Обо мне",
  "header__menuItem__Contacts": "Контакты",
  "header__menuItem__Examples": "Примеры работ",
  "header__menuItem__Skills": "Навыки",
  "header__menuItem__Specialization": "Моя специализация",
  "header__menuItem__Top": "В начало",
  "loadingMessage": "Загрузка...",
  "noDataMessage": "Нет данных",
  "specialization__backendCard__text": "Разработка на Node.js и Express. Использую MongoDB и socket-ы. unit тестирование с помощью Mocha, Chai. Док-ция на Swagger. Docker для разворачивания Node.js приложений. Есть опыт разработки REST-сервисов на Python/Django/MySQL.",
  "specialization__frontendCard__text": "Разработка на React.js/Redux. Адаптивная вёрстка с помощью Flexbox и CSS Grid. Самостоятельная настройка сборки проекта. Разные виды тестирования.",
  "specialization__miscCard__text": "Есть опыт в моделировании физических процессов. DevOps на Python. Разработка для Windows Phone, JavaME. Программировании микроконтроллеров Siemens...",
  "specialization__miscCard__title": "Разное",
  "specialization__subTitle": "Детали можно узнать в <a>моём резюме</a>",
  "specialization__title": "Специализация"
}
