{
  "about__myInterests": "Последние несколько лет я специализируюсь во фронтенд-разработке. В свободное от работы время я играю в футбол, увлекаюсь рыбалкой, бегом и беговыми лыжами.",
  "about__subTitle": "немного о себе...",
  "about__title": "Привет!",
  "about__whatIhaveLearned__text": "Веб для меня по-настоящему начинался с Python и Django в далёком 2011 году.<br />С 2014 года я начал заниматься SPA с помощью <strong>AngularJS</strong>. Занимался этим порядка 3 лет.<br />С 2017 года переключился на <strong>React</strong>. Делал SPA. Реализовал на нём несколько успешных проектов (см. примеры работ). Мне везло – я приходил на проекты, когда всё только начиналось, принимал активнейшее участие в разработке и выводил приложение в продакшен. За это время я успел опробовать различные UI kit-ы, state manager-ы, а также другие тулы и библиотеки. Сам настраивал линтинг и билд процесс, внедрял автоматизированное тестирование, занимался автоматизацией выпуска версий.<br />В 2023 году я приобщился к миру <strong>SSR</strong> (Next.js) и познакомился с TurboRepo.",
  "about__whatIhaveLearned__title": "Что я успел попробовать во фронтенде",
  "about__whatIwantToLearn__text": "* <strong>SSR</strong> - я бы хотел продолжить с SSR. Если конечно это подходит для разрабатываемого приложения!<br />* <strong>Микрофронтенды</strong> - было бы интересно построить большое приложение на базе micro-frontend-ов или постепенно перевести legacy-приложение на новый фреймворк и их помощью.<br />* <strong>StoryBook</strong> - разработка собственного UI Kit-а и его документирование с помощью StoryBook.<br />* <strong>Монорепа</strong> – для некоторых продуктов очень удобно его использовать. Например, фронтенд и бэкенд в одном репозитории или несколько небольших микрофронтендов, которые сильно связаны и разрабатываются одном командой.<br />* <strong>Vue 3</strong> – мне было бы интересно попробовать его в коммерческой разработке.<br />* <strong>GraphQL</strong> – в коммерческих проектах мне попадались только REST-интерфейсы, было бы интересно попробовать что-то другое ))",
  "about__whatIwantToLearn__title": "Что я хотел бы ещё попробовать во фронтенде",
  "about__whereIlive": "Меня зовут Алексей. Я профессионально программирую с 2003 года. За это время я поучаствовал во множестве проектов, где разрабатывал мобильные, бэкенд, фронтенд приложения. До этого занимался созданием инструментов для разработчиков, моделированием физических процессов, автоматизацией и многим другим.",
  "autocomplete__noOptionsText": "Нет опций",
  "backToHomeButton__text": "Вернуться на главную",
  "buttonText__Cancel": "Отмена",
  "contacts__email__label": "Почта",
  "contacts__location__label": "Расположение",
  "contacts__location__value": "Нижегородская область, Саров",
  "contacts__phone__label": "Телефон, Телеграмм, WhatsApp, Viber",
  "contacts__resume__label": "Резюме",
  "contacts__subTitle": "Просто свяжитесь со мной",
  "contacts__title": "Контакты",
  "customer": "заказчик",
  "defaultErrorMessage": "Что-то пошло не так",
  "errorMessage__pageNotFound": "Страница не найдена",
  "errorPage404__hint__wrongUrl": "Возможно, вы указали неверный URL",
  "examplePopUp__demoLabel": "Демо",
  "example__subTitle": "Кликните на картинке для получения деталей",
  "examples__acceptant__description": "Мордовия, пилотный проект системы обработки ЕСЭК (Единой Социальной Электронной Карты) для транспортных приложений.",
  "examples__acceptant__name": "АРМ организации поставщика транспортных услуг",
  "examples__alarm__description": "Проект \"Акустический мониторинг\".",
  "examples__alarm__name": "Панель тревог",
  "examples__asr__description": "ASR (Automatic Speech Recognition) HTTP. HTTP-интерфейс к распознавателю речи, который разрабатывался в «ИТЦ Система-Саров»",
  "examples__asr__name": "Веб-сервис для распознавания русской речи",
  "examples__bk__description": "Новый лэндинг для проекта бойцовского клуба с уникальным запоминающимся дизайном",
  "examples__bk__name": "Бойцовский клуб РЕН ТВ",
  "examples__cloudike__description": "Frontend на React.js. Material UI. Интерфейс для управления бэкендом Cloudike. Что такое Cloudike? - cloudike.com",
  "examples__cloudike__name": "Новая админка Cloudike",
  "examples__co2__description": "Проект \"Мониторинг содержания CO2 в воздухе офиса\". Front-end and back-end (angular, node).",
  "examples__co2__name": "CO2",
  "examples__croc__description": "Frontend на React.js, Redux. Интерфейс для управления ресурсами в облаке: создание виртуальных машин, управление дисками, выделение машинам \"белых\" IP-шников, организация подсетей, управление доступом и многое другое",
  "examples__croc__name": "Новая консоль управления Облака КРОК",
  "examples__detector__description": "Проект \"Акустический мониторинг\". Административный интерфейс для управления настройками акустического детектора, аналогичный интерфейсу управления обычным WiFi-роутером. А также back-end.",
  "examples__detector__name": "Detector UI",
  "examples__dora__description": "Мобильное приложение для Windows Phone. Мобильное приложение на JavaME. Измерение текущего значения радиационного фона с помощью датчика, подключенного к смартфону. Более подробная информация на do-ra.ru",
  "examples__dora__name": "ДО-РА, мобильный дозиметр-радиометр",
  "examples__iz__description": "Занимаюсь поддержкой сайтов Известий и РенТВ. Также разработал с командой 2 новых фронтенда в рамках проекта \"СУЗ - Система Управления Заявками\".<br />С помощью этой системы пользователи сообщают в редакцию об интересных информационных событиях, прикладывают фотографии, видеофайлы.<br />Операторы системы изучают присланные сообщения. Наиболее интересные отбираются и по ним снимаются репортажи и пишутся информационные заметки/статьи.<br />1-ый фронтенд - это публичная часть, с помощью которой пользователи сообщают о событиях. Это Next.js приложение. Используется Material UI v5.<br />2-ой фронтенд - это админка, с помощью которой операторы системы обрабатывают присланные сообщения и медиа-файлы. Это SPA на React.js и Material UI v5.",
  "examples__iz__name": "Известия, Рен ТВ, СУЗ",
  "examples__mentor__description": "Frontend на React.js, Redux, RxJS. Прослушивание записей телефонных переговоров, просмотр и изучение результатов анализа речи. Wave-форма, тайм-лайны.",
  "examples__mentor__name": "Сервис Речевой Аналитики",
  "examples__mordovia__description": "Мордовия, пилотный проект системы обработки ЕСЭК (Единой Социальной Электронной Карты) для транспортных приложений.",
  "examples__mordovia__name": "Dashboard",
  "examples__novakid__description": "Frontend на React.js и Material UI. Интерфейс для управления подпиской, бронирования уроков, мониторинга успехов ребёнка и т.д.",
  "examples__novakid__name": "NovaKid - новый кабинет родителя",
  "examples__safeCity__description": "Приложение \"Мобильный Монитор\" для Windows Phone. Измерение различных параметров состояния окружающей среды с помощью датчиков, подключенных к смартфону.",
  "examples__safeCity__name": "Безопасный Город",
  "examples__title": "Примеры работ",
  "examples__uptime__name": "Мониторинг оборудования на автобусах/троллейбусах",
  "examples__virtman__description": "Вместе с другими членами команды я разрабатываю административный интерфейс для облачного сервиса виртуализации. С помощью нашего UI пользователи могут создавать виртуальные машины, диски в облаке, управлять ими, решать вычислительные и другие задачи на созданных машинах.",
  "examples__virtman__name": "Облачная система виртуализации для ФНС России",
  "examples__votum__description": "Распределенная система дистанционного электронного голосования с использованием нескольких каналов передачи информации (WEB, SMS, e-mail) и архитектурой SOA (Service Oriented Architecture).",
  "examples__votum__name": "Система интернет-голосования Votum",
  "header__menuItem__About": "Обо мне",
  "header__menuItem__Contacts": "Контакты",
  "header__menuItem__Examples": "Примеры работ",
  "header__menuItem__FuturePlans": "Планы",
  "header__menuItem__Skills": "Навыки",
  "header__menuItem__Specialization": "Моя специализация",
  "header__menuItem__ToBeginning": "В начало",
  "howIcanHelp__createArch": "Разработаю архитектуру приложения (modules, feature-sliced design)",
  "howIcanHelp__createInfra": "Создам рабочую инфраструктуру (repo, build, type-checking, linting, auto code formatting)",
  "howIcanHelp__headDevelopment": "Возглавлю разработку",
  "howIcanHelp__introTesting": "Внедрю автоматизированное тестирование (unit, integration, E2E)",
  "howIcanHelp__orgDeploy": "Автоматизирую выпуск новых версий и их deploy + аналитика, crash reporting",
  "howIcanHelp__orgReview": "Обеспечу качественное ревью и обучение младших разработчиков",
  "howIcanHelp__subTitle": "Что я могу для вас сделать",
  "loadingMessage": "Загрузка...",
  "noDataMessage": "Нет данных",
  "picture__IAM": "Меня зовут Алексей",
  "picture__IamProgrammer": "И я люблю разрабатывать UI",
  "skills__subTitle": "Здесь я попытался примерно оценить \"полноту\" своих знаний",
  "skills__title": "Знание технологий и инструментов",
  "specialization__backendCard__text": "Разработка на Node.js и Express. Использую MongoDB и socket-ы. unit тестирование с помощью Mocha, Chai. Док-ция на Swagger. Docker для разворачивания Node.js приложений. Есть опыт разработки REST-сервисов на Python/Django/MySQL.",
  "specialization__frontendCard__text": "Разработка на React.js. Стилизация приложения согласно дизайну. Разработка библиотек компонентов. Адаптивная вёрстка с помощью Flexbox и CSS Grid. Самостоятельная настройка сборки проекта. Разные виды тестирования.",
  "specialization__miscCard__text": "Есть опыт в моделировании физических процессов. DevOps на Python. Разработка для Windows Phone, JavaME. Программировании микроконтроллеров Siemens...",
  "specialization__miscCard__title": "Разное",
  "specialization__subTitle": "Детали можно узнать в <a>моём резюме</a>",
  "specialization__title": "Специализация",
  "year": "год"
}
